Public Member Functions | List of all members
API_IAttributeEventHandler Class Reference
Notifications Manager
Defining an interface for Attribute event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IAttributeEventHandler:
 Public Member Functions
virtual GS::UniString  | GetName () const override final
virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const override final
 virtual GS::UniString  | GetName () const =0
 virtual void  | Dispatch (const API_IEventNotifier &eventNotfier) const =0
 Public Member Functions inherited from API_IObjectEventHandler
 virtual void  | OnCreated (const GS::HashSet< API_Guid > &) const
 virtual void  | OnModified (const GS::HashSet< API_Guid > &) const
 virtual void  | OnDeleted (const GS::HashSet< API_Guid > &) const
Detailed Description
Defining an interface for Attribute event handlers.
Since
Archicad 26
Member Function Documentation
◆ Dispatch()
 virtual void API_IAttributeEventHandler::Dispatch  |  ( |  const API_IEventNotifier &  |  eventNotfier | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.
◆ GetName()
 virtual GS::UniString API_IAttributeEventHandler::GetName  |  ( |   | ) |   const
inlinefinaloverridevirtual
Implements API_IEventHandler.